{
	"FormatVersion": 2,
	"Namespace": "",
	"Subnamespaces": [
		{
			"Namespace": "UObjectToolTips",
			"Children": [
				{
					"Source":
					{
						"Text": "Implements a factory for UFileMediaSource objects."
					},
					"Translation":
					{
						"Text": "Implements a factory for UFileMediaSource objects."
					},
					"Key": "PS4FileMediaSourceFactory"
				},
				{
					"Source":
					{
						"Text": "Settings for the PS4Media plug-in."
					},
					"Translation":
					{
						"Text": "Settings for the PS4Media plug-in."
					},
					"Key": "PS4MediaSettings"
				},
				{
					"Source":
					{
						"Text": "The number of output video frame buffers (default = 6)."
					},
					"Translation":
					{
						"Text": "The number of output video frame buffers (default = 6)."
					},
					"Key": "PS4MediaSettings:OutputVideoFrameBuffers"
				},
				{
					"Source":
					{
						"Text": "The video buffer size for HLS media sources (in MB, default = 8)."
					},
					"Translation":
					{
						"Text": "The video buffer size for HLS media sources (in MB, default = 8)."
					},
					"Key": "PS4MediaSettings:HlsVideoBufferSizeMB"
				},
				{
					"Source":
					{
						"Text": "The video buffer size for local file media sources (in MB, default = 1)."
					},
					"Translation":
					{
						"Text": "The video buffer size for local file media sources (in MB, default = 1)."
					},
					"Key": "PS4MediaSettings:FileVideoBufferSizeMB"
				}
			]
		}
	]
}